CSI API ETABS v1
cPluginContract.Main Method
 The entry point for launching the plugin
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
void Main(
	ref cSapModel SapModel,
	ref cPluginCallback ISapPlugin
)
Sub Main (
	ByRef SapModel As cSapModel,
	ByRef ISapPlugin As cPluginCallback
)
Dim instance As cPluginContract
Dim SapModel As cSapModel
Dim ISapPlugin As cPluginCallback
instance.Main(SapModel, ISapPlugin)
void Main(
	cSapModel^% SapModel,
	cPluginCallback^% ISapPlugin
)
abstract Main :
        SapModel : cSapModel byref *
        ISapPlugin : cPluginCallback byref -> unit
Parameters
SapModel
Type: ETABSv1.cSapModel
 A reference to the SapModel object upon which all operations will be performed
ISapPlugin
Type: ETABSv1.cPluginCallback
 A reference to the callback object, used to retrieve the plugin status and notify the program when the plugin is closed
See Also
Reference
cPluginContract Interface
ETABSv1 Namespace